## Script Contents
### Wrangling and consistency checks
### Combinging data

## 1) 'customers' csv downloaded and saved

## 2) New notebook created

## 3) Import analysis libraries and dataframe

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'C:\Users\anon\Documents\CareerFoundry\Data Analytics Immersion\Instacart Basket Analysis'

In [3]:
customers = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'))

## 4 & 5) Wrangle the data & complete fundamental data quality and consistency checks

In [4]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [6]:
# Look for missing values

customers['user_id'].isna().sum()

0

In [7]:
customers['STATE'].isna().sum()

0

In [8]:
customers['date_joined'].isna().sum()

0

In [9]:
customers['First Name'].isna().sum()

11259

In [10]:
customers['Surnam'].isna().sum()

0

### NOTE: I am keeping the rows with null values for customer first name as I don't believe this will impact analysis

In [11]:
# Rename columns

customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [12]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [13]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [14]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [15]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [16]:
customers.rename(columns = {'n_dependants' : 'num_dependents'}, inplace = True)

In [17]:
customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,num_dependents,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [18]:
# Check summary stats and types

customers.describe()

             user_id            age  num_dependents         income
count  206209.000000  206209.000000   206209.000000  206209.000000
mean   103105.000000      49.501646        1.499823   94632.852548
std     59527.555167      18.480962        1.118433   42473.786988
min         1.000000      18.000000        0.000000   25903.000000
25%     51553.000000      33.000000        0.000000   59874.000000
50%    103105.000000      49.000000        1.000000   93547.000000
75%    154657.000000      66.000000        3.000000  124244.000000
max    206209.000000      81.000000        3.000000  593901.000000

In [19]:
customers['first_name'].dtype

dtype('O')

In [20]:
customers['date_joined'].dtype

dtype('O')

In [21]:
# Check for duplicates

cust_dupes = customers[customers.duplicated()]

In [22]:
cust_dupes

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, num_dependents, fam_status, income]
Index: []

In [23]:
clean_cust = customers

In [33]:
clean_cust.shape

(206209, 10)

In [24]:
clean_cust.head()

,user_id,first_name,surname,gender,state,age,date_joined,num_dependents,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### NOTE: I am choosing to keep all columns, as I don't yet know what will be useful for final analyses

## 6) Combine your customer data with the rest of your prepared Instacart data

In [25]:
ords_prods = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_group_agg.pkl'))

In [26]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 20 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_the_week  int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  _merge                  category
 14  max_order               int64
 15  loyalty_flag            object
 16  average_price           float64
 17  spending_flag           object
 18  order_frequency         object
 19  median_days             float64
dtypes: category(1), float64(4), int64(11), object(4)
memory usage: 4.9+ GB

In [27]:
# Drop merge column from 'ords_prods'

ords_prods = ords_prods.drop(columns = ['_merge'])

In [28]:
ords_prods.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,max_order,loyalty_flag,average_price,spending_flag,order_frequency,median_days
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,10,New customer,6.367797,Low spender,Non-frequent customer,20.5
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,10,New customer,6.367797,Low spender,Non-frequent customer,20.5
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,10,New customer,6.367797,Low spender,Non-frequent customer,20.5
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,10,New customer,6.367797,Low spender,Non-frequent customer,20.5
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,10,New customer,6.367797,Low spender,Non-frequent customer,20.5

In [29]:
# Merging 'ords_prods' with 'clean_cust'

cust_ords_prods = ords_prods.merge(clean_cust, on = 'user_id', indicator = True)

In [30]:
cust_ords_prods.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,first_name,surname,gender,state,age,date_joined,num_dependents,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [31]:
# Drop merge column from 'cust_ords_prods'

cust_ords_prods = cust_ords_prods.drop(columns = ['_merge'])

In [32]:
# Pkl export

cust_ords_prods.to_pickle(os.path.join(path, 'Data','Prepared Data', 'cust_ords_prods.pkl'))